#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
<pre>terraform
module.thadmin_hosting.aws_s3_bucket.this: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_routing.module.cloudfront.aws_cloudfront_origin_access_identity.this["s3_bucket"]: Refreshing state... [id=E3JOC36ODMBL65]
module.thadmin_routing.module.acm.aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:627002765486:certificate/565d3a00-d047-48f2-956a-aed08dd6956b]
module.thadmin_routing.module.acm.aws_route53_record.validation["thadmin-staging.technicie.nl"]: Refreshing state... [id=Z3I4ZHBBD5NSHU__f4c1968cf0da5157d0f46ed63ecf426e.thadmin-staging.technicie.nl._CNAME]
module.thadmin_routing.module.acm.aws_acm_certificate_validation.this: Refreshing state... [id=2021-04-14 20:17:10 +0000 UTC]
module.thadmin_routing.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_routing.module.cloudfront.aws_cloudfront_distribution.this[0]: Refreshing state... [id=E2ZP8HCBLISQFN]
module.thadmin_routing.aws_route53_record.api: Refreshing state... [id=Z3I4ZHBBD5NSHU_thadmin-staging_A]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["img/backgroundImage.5f59aad8.jpg"]: Refreshing state... [id=img/backgroundImage.5f59aad8.jpg]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/chunk-vendors.838b8b77.js.map"]: Refreshing state... [id=js/chunk-vendors.838b8b77.js.map]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["favicon-32x32.png"]: Refreshing state... [id=favicon-32x32.png]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["mstile-144x144.png"]: Refreshing state... [id=mstile-144x144.png]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["site.webmanifest"]: Refreshing state... [id=site.webmanifest]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-touch-icon.png"]: Refreshing state... [id=apple-touch-icon.png]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["favicon-16x16.png"]: Refreshing state... [id=favicon-16x16.png]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["index.html"]: Refreshing state... [id=index.html]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["img/anonymousUser.61cf6ed7.jpg"]: Refreshing state... [id=img/anonymousUser.61cf6ed7.jpg]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/app.15800671.js"]: Refreshing state... [id=js/app.15800671.js]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["css/chunk-vendors.52eaf30c.css"]: Refreshing state... [id=css/chunk-vendors.52eaf30c.css]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["css/app.5cb3befb.css"]: Refreshing state... [id=css/app.5cb3befb.css]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["android-chrome-512x512.png"]: Refreshing state... [id=android-chrome-512x512.png]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["android-chrome-192x192.png"]: Refreshing state... [id=android-chrome-192x192.png]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["safari-pinned-tab.svg"]: Refreshing state... [id=safari-pinned-tab.svg]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/chunk-0a25be67.d7904046.js.map"]: Refreshing state... [id=js/chunk-0a25be67.d7904046.js.map]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/app.15800671.js.map"]: Refreshing state... [id=js/app.15800671.js.map]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["browserconfig.xml"]: Refreshing state... [id=browserconfig.xml]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/chunk-0a25be67.d7904046.js"]: Refreshing state... [id=js/chunk-0a25be67.d7904046.js]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["mstile-150x150.png"]: Refreshing state... [id=mstile-150x150.png]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["mstile-310x150.png"]: Refreshing state... [id=mstile-310x150.png]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/chunk-vendors.838b8b77.js"]: Refreshing state... [id=js/chunk-vendors.838b8b77.js]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["favicon.svg"]: Refreshing state... [id=favicon.svg]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["mstile-70x70.png"]: Refreshing state... [id=mstile-70x70.png]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["favicon.png"]: Refreshing state... [id=favicon.png]
module.thadmin_hosting.aws_s3_bucket_object.code_build_object["mstile-310x310.png"]: Refreshing state... [id=mstile-310x310.png]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-splash-1125-2436.jpg"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "49f02231d32891c96db3243c0083820c"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "apple-splash-1125-2436.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/apple-splash-1125-2436.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-splash-1136-640.jpg"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "00fbd1fbfe39a91f4e322c8a043a836b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "apple-splash-1136-640.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/apple-splash-1136-640.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-splash-1170-2532.jpg"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "7bfda586cce022509d7700bfc7331448"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "apple-splash-1170-2532.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/apple-splash-1170-2532.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-splash-1242-2208.jpg"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "5ae2c1ff28ef88b62be04d72e893f07e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "apple-splash-1242-2208.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/apple-splash-1242-2208.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-splash-1242-2688.jpg"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "afa6af29db419785374ca4b77b687cce"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "apple-splash-1242-2688.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/apple-splash-1242-2688.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-splash-1284-2778.jpg"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "6281d98fddbdce882448a263f75a3681"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "apple-splash-1284-2778.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/apple-splash-1284-2778.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-splash-1334-750.jpg"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "a9781cbfae7660b5f84a2d5210b1a4e5"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "apple-splash-1334-750.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/apple-splash-1334-750.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-splash-1536-2048.jpg"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "d41d8cd98f00b204e9800998ecf8427e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "apple-splash-1536-2048.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/apple-splash-1536-2048.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-splash-1620-2160.jpg"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "d41d8cd98f00b204e9800998ecf8427e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "apple-splash-1620-2160.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/apple-splash-1620-2160.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-splash-1668-2224.jpg"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "d41d8cd98f00b204e9800998ecf8427e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "apple-splash-1668-2224.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/apple-splash-1668-2224.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-splash-1668-2388.jpg"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "d41d8cd98f00b204e9800998ecf8427e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "apple-splash-1668-2388.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/apple-splash-1668-2388.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-splash-1792-828.jpg"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "d41d8cd98f00b204e9800998ecf8427e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "apple-splash-1792-828.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/apple-splash-1792-828.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-splash-2048-1536.jpg"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "d41d8cd98f00b204e9800998ecf8427e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "apple-splash-2048-1536.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/apple-splash-2048-1536.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-splash-2048-2732.jpg"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "350ecc6eda851eb0e6bc60cd55658fa2"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "apple-splash-2048-2732.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/apple-splash-2048-2732.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-splash-2160-1620.jpg"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "d41d8cd98f00b204e9800998ecf8427e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "apple-splash-2160-1620.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/apple-splash-2160-1620.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-splash-2208-1242.jpg"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "d41d8cd98f00b204e9800998ecf8427e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "apple-splash-2208-1242.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/apple-splash-2208-1242.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-splash-2224-1668.jpg"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "d41d8cd98f00b204e9800998ecf8427e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "apple-splash-2224-1668.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/apple-splash-2224-1668.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-splash-2388-1668.jpg"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "d41d8cd98f00b204e9800998ecf8427e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "apple-splash-2388-1668.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/apple-splash-2388-1668.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-splash-2436-1125.jpg"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "d41d8cd98f00b204e9800998ecf8427e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "apple-splash-2436-1125.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/apple-splash-2436-1125.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-splash-2532-1170.jpg"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "d41d8cd98f00b204e9800998ecf8427e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "apple-splash-2532-1170.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/apple-splash-2532-1170.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-splash-2688-1242.jpg"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "d41d8cd98f00b204e9800998ecf8427e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "apple-splash-2688-1242.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/apple-splash-2688-1242.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-splash-2732-2048.jpg"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "d41d8cd98f00b204e9800998ecf8427e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "apple-splash-2732-2048.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/apple-splash-2732-2048.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-splash-2778-1284.jpg"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "d41d8cd98f00b204e9800998ecf8427e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "apple-splash-2778-1284.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/apple-splash-2778-1284.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-splash-640-1136.jpg"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "8fc93355adedae18cab811c7d031cacf"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "apple-splash-640-1136.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/apple-splash-640-1136.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-splash-750-1334.jpg"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "d3f9b588f3a9765c71b3250801e548c5"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "apple-splash-750-1334.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/apple-splash-750-1334.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["apple-splash-828-1792.jpg"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "b5ba7c9971565c88790e2bb134d7403a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "apple-splash-828-1792.jpg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/apple-splash-828-1792.jpg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["index.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "code_build_object" {
      ~ etag               = "a073ac25d11fdb8f808d40d87f21443e" -> "f1e936852264ba446a0b82cec5f627bc"
        id                 = "index.html"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/app.15800671.js"] will be destroyed
  - resource "aws_s3_bucket_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "text/javascript" -> null
      - etag               = "6a4ce5f9d2b8425945c1eccfff5bcaf3" -> null
      - force_destroy      = false -> null
      - id                 = "js/app.15800671.js" -> null
      - key                = "js/app.15800671.js" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.15800671.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/app.15800671.js.map"] will be destroyed
  - resource "aws_s3_bucket_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/octet-stream" -> null
      - etag               = "21a3d9350e2235582b6b67311b8e7986" -> null
      - force_destroy      = false -> null
      - id                 = "js/app.15800671.js.map" -> null
      - key                = "js/app.15800671.js.map" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.15800671.js.map" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/app.2d2cc00a.js"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "df04723e6fa8448b66c9dca161f6da1b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/app.2d2cc00a.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.2d2cc00a.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_bucket_object.code_build_object["js/app.2d2cc00a.js.map"] will be created
  + resource "aws_s3_bucket_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "67f9d036e13935eb06ecc64f598220e8"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/app.2d2cc00a.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.2d2cc00a.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 28 to add, 1 to change, 2 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

</pre>
</details>